Revit 2026 API

# ParameterSet(Int32) Method

---

Sets the parameter to a new integer value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Set(
	int value
)
```
```vb
Public Function Set (
	value As Integer
) As Boolean
```
```cpp
public:
bool Set(
	int value
)
```
```fsharp
member Set :
        value : int -> bool
```

#### Parameters

value Int32
    The new integer value to which the parameter is to be set.

#### Return Value

BooleanThe Set method will return True if the parameter was successfully set to the new value, otherwise false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The parameter is read-only. |

You should only use this method if the StorageType property reports the type of the parameter as an integer.

#### Reference

Parameter Class

Set Overload

Autodesk.Revit.DB Namespace